Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/cohabiting_couples/surrogate_motherhood_and_same_sex_couples.html.txt.tmx
Source language: en
Languages: ga

source: Surrogate motherhood and same-sex couples
ga: Máithreacht ionaid agus lánúineacha den ghnéas céanna

source: Surrogate motherhood happens when a woman agrees to be artificially inseminated or to have an embryo transferred to her womb in order to become pregnant
ga: Tarlaíonn máithreacht ionaid nuair a ghlacann bean le bheith inseamhnaithe go saorga nó le suth a aistriú go dtí a broinn chun go n-éireodh sí torrach

source: She then carries the child to term with the intention of giving the custody of the child to the person/couple with whom she has made the agreement
ga: Iompraíonn sí an leanbh ansin go téarma agus é ar intinn aici caomhnadh an linbh a thabhairt don duine/lánúin lena ndearna sí an socrú

source: Traditionally, the surrogate mother is considered the legal mother of the child and is the child's guardian
ga: Go traidisiúnta, is í an mháthair ionaid máthair nádúrtha an linbh go dlíthiúil agus is í caomhnóir an linbh í

source: Private adoptions are not permitted in Ireland, and a parent of a child is prohibited from receiving any payment for giving away a child for adoption
ga: Ní cheadaítear uchtáil phríobháideach in Éirinn, agus tá cosc ar thuismitheoir linbh glacadh le íocaíocht ar leanbh a thabhairt suas le n-uchtú

source: If the child is being adopted, this must be done through the Adoption Authority of Ireland, and there is no guarantee that the child of a surrogate mother will be placed with the biological father
ga: Caithfear uchtú an linbh a dhéanamh tríd an Údarás Uchtála agus níl aon ráthaíocht ann go dtabharfar an leanbh a rugadh do mháthair ionaid, ar láimh don athair

source: In theory, a man could donate sperm so that his child could be conceived by a surrogate mother (as long as he did not pay her)
ga: Go teoiriciúil, is féidir le fear speirm a dheonadh chun go bhféadfadh an mháthair ionaid an leanbh a ghabhadh (chomh fada agus nár íoc sé í)

source: He could then apply to the Adoption Authority for permission to adopt his child
ga: D'fhéadfadh sé ansin iarratas a dhéanamh chun a leanbh a uchtú

source: When making its decision, the Adoption Authority must consider the welfare of the child
ga: Bhreithneodh an Údarás Uchtála leas an linbh, nuair a bhíonn sé ag déanamh an chinneadh

source: You can also read more about adoption procedures in Ireland and inter-country adoptions
ga: Léigh níos mó faoi nósanna imeachta glactha in Éirinn agus idir-tír uchtuithe
